Dlubal.RFEM5.MemberHinge
Member hinge parameters

Dlubal.RFEM5.MemberHinge.No
Number

Dlubal.RFEM5.MemberHinge.ID
Identifier

Dlubal.RFEM5.MemberHinge.Comment
Comment

Dlubal.RFEM5.MemberHinge.Tag
Tag

Dlubal.RFEM5.MemberHinge.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.MemberHinge.ReferenceSystem
Hinge reference system

Dlubal.RFEM5.MemberHinge.UserDefinedReferenceSystem
User-defined reference system

Dlubal.RFEM5.MemberHinge.TranslationalConstantX
Translation release ux

Dlubal.RFEM5.MemberHinge.TranslationalConstantY
Translation release uy

Dlubal.RFEM5.MemberHinge.TranslationalConstantZ
Translation release uz

Dlubal.RFEM5.MemberHinge.RotationalConstantX
Rotational release φx

Dlubal.RFEM5.MemberHinge.RotationalConstantY
Rotational release φy

Dlubal.RFEM5.MemberHinge.RotationalConstantZ
Rotational release φz

Dlubal.RFEM5.MemberHinge.TranslationalNonlinearityX
Nonlinearity in ux

Dlubal.RFEM5.MemberHinge.TranslationalNonlinearityY
Nonlinearity in uy

Dlubal.RFEM5.MemberHinge.TranslationalNonlinearityZ
Nonlinearity in uz

Dlubal.RFEM5.MemberHinge.RotationalNonlinearityX
Nonlinearity in φx

Dlubal.RFEM5.MemberHinge.RotationalNonlinearityY
Nonlinearity in φy

Dlubal.RFEM5.MemberHinge.RotationalNonlinearityZ
Nonlinearity in φz

Dlubal.RFEM5.MemberHinge.TranslationalSpecialX
Special type of hinge in ux

Dlubal.RFEM5.MemberHinge.TranslationalSpecialY
Special type of hinge in uy

Dlubal.RFEM5.MemberHinge.TranslationalSpecialZ
Special type of hinge in uz

Dlubal.RFEM5.MemberHinge.RotationalSpecialX
Special type of hinge in φx

Dlubal.RFEM5.MemberHinge.RotationalSpecialY
Special type of hinge in φy

Dlubal.RFEM5.MemberHinge.RotationalSpecialZ
Special type of hinge in φz